Study2/src/DataProcessors/ТаблицаПродаж/ТаблицаПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ТаблицаПродаж</name>
</mdclass:DataProcessor>

Study2/src/Documents/ПродажаУцененногоТовара/ПродажаУцененногоТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаУцененногоТовара</name>
  <basedOn>Document.УценкаТовара</basedOn>
  <registerRecords>AccumulationRegister.ПродажаТовара</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТовара</registerRecords>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Study2/src/DataProcessors/ТаблицаПродаж/Forms/Форма/Module.bsl
&НаСервере
Процедура ВывестиТаблицуНаСервере()
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяНоменклатура.Номенклатура КАК Номенклатура,
		|	РасходнаяНакладнаяНоменклатура.Количество КАК Количество,
		|	РасходнаяНакладнаяНоменклатура.Сумма КАК Сумма,
		|	РасходнаяНакладная.Филиал.Город КАК Город,
		|	РасходнаяНакладная.Филиал КАК Филиал,
		|	""Обычный товар"" КАК ТипПродажи
		|ИЗ
		|	Документ.РасходнаяНакладная.Номенклатура КАК РасходнаяНакладнаяНоменклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ПО РасходнаяНакладнаяНоменклатура.Ссылка = РасходнаяНакладная.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажаУцененногоТовараНоменклатура.Номенклатура,
		|	ПродажаУцененногоТовараНоменклатура.Количество,
		|	ПродажаУцененногоТовараНоменклатура.Сумма,
		|	ПродажаУцененногоТовара.Филиал.Город,
		|	ПродажаУцененногоТовара.Филиал,
		|	""Уцененный товар""
		|ИЗ
		|	Документ.ПродажаУцененногоТовара.Номенклатура КАК ПродажаУцененногоТовараНоменклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПродажаУцененногоТовара КАК ПродажаУцененногоТовара
		|		ПО ПродажаУцененногоТовараНоменклатура.Ссылка = ПродажаУцененногоТовара.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	ТаблицаРезультат.Свернуть("Город, Номенклатура", "Количество");
	ТаблицаПродаж.Загрузить(ТаблицаРезультат);
	

КонецПроцедуры

&НаКлиенте
Процедура ВывестиТаблицу(Команда)
	ВывестиТаблицуНаСервере();
КонецПроцедуры
